In [1]:
import pandas as pd
import numpy as np

In [7]:
data={'one':pd.Series([2,1,4,3]),
     'two':pd.Series([1000,43,23,14]),
     'three':pd.Series([1010,20,300,4]),
     'four':pd.Series([1000,2000,3000,4000])}

In [8]:
df=pd.DataFrame(data)

In [10]:
df

   one   two  three  four
0    2  1000   1010  1000
1    1    43     20  2000
2    4    23    300  3000
3    3    14      4  4000

In [23]:
df.sort_values(by=['one'])

   one   two  three  four
1    1    43     20  2000
0    2  1000   1010  1000
3    3    14      4  4000
2    4    23    300  3000

sort using sorting algos:
    quick
    merge
    heapsort

In [22]:
df.sort_values(by=['one'],kind='heapsort')

   one   two  three  four
1    1    43     20  2000
0    2  1000   1010  1000
3    3    14      4  4000
2    4    23    300  3000